//
//  DataManager.swift
//  CodemakersTeam
//
//  Created by Nikita Zharinov on 21/02/2021.
//

class DataManager {
    
    static let shared = DataManager()
    let names = ["Сергей", "Никита", "Вячеслав", "Алена","Никита"]
    let surnames = ["Корнев", "Жаринов", "Шангин", "Илясова", "Белов"]
    let photos = ["kornev.jpg", "zharinov.png", "photo2", "Alena","belov"]
    let cities = ["Рязань", "Братислава", "Тольятти", "Город Алёны","Москва"]
    let familyStatus = ["Женат", "Женат", "Женат", "Замужем", "Женат"]
    let ages = ["37", "55", "34", "28","29"]
    let hobbies = [
        "Увлекаюсь ездой не велосипеде, люблю отдых на природе, вкусно поесть, хорошую музыку",
        "Увлекаюсь альпинизмом, дайвингом и горными лыжами",
        "Рыбалка, туризм",
        "Танцы, нейропсихология, активные виды спорта",
        "Увлекаюсь экстримальными видами спорта и музыкой"
    ]
    
    let jobs = [
        "Менеджер по продажам с/х техники",
        "IBM",
        "1с разработчик",
        "Отделе экономики и финансов в НЦВ",
        "Cтанция виндсерфинга и кайтсерфинга Ветротория"
    ]
    
    let jobPositions = [
        "ТЦ 'Агрит', дилер КЗ 'Ростсельмаш'",
        "Менеджер по продажам",
        "Начальник отдела АСУ",
        "Ведущий специалист",
        "Инструктор"
    ]
    
    let emails = [
        "post.kornev@gmail.com",
        "nikita.zharinov@gmail.com",
        "slava-poison@yandex.ru",
        "aalazuka@gmail.com",
        "nikita99belov@gmail.com"
    ]
    
    let phones = [
        "+7 (920) 636-33-22",
        "+421 (904) 746337",
        "+8 (927) 213-44-34",
        "+7 (915) 376-04-50",
        "+7 (991) 302-28-40"
    ]
    
    private init() {}
}
